3B/SE464/13-Push-Notification.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-10 Tue 15:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Push Notification</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Push Notification</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6eb1ed9">1. Motivation</a></li>
<li><a href="#org6ceacf7">2. Push Notifications</a>
<ul>
<li><a href="#org7434bfe">2.1. Smartphones</a>
<ul>
<li><a href="#org8edf70f">2.1.1. Device Registration</a></li>
</ul>
</li>
<li><a href="#orge93ed53">2.2. Web Browsers</a>
<ul>
<li><a href="#org1a22bc0">2.2.1. Websockets</a></li>
<li><a href="#orga517ca5">2.2.2. Long-Polling</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7657fbd">3. Challenges</a>
<ul>
<li><a href="#org87210f8">3.1. Notification Service</a></li>
<li><a href="#orgdb4ffc0">3.2. API Gateway</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org6eb1ed9" class="outline-2">
<h2 id="org6eb1ed9"><span class="section-number-2">1.</span> Motivation</h2>
<div class="outline-text-2" id="text-1">
<p>
In client-server architecture, client makes request and server sends responses, so client
must start all interactions.
</p>

<p>
Helpful for server to start an interaction when some interaction is caused by another user&rsquo;s action or
some timed event.
</p>

<p>
Possible to notify users by sending emails, but these are limited.
Can send links o apps, but cannot directly interact with your app.
</p>

<p>
Want to be able to send request to a client app.
</p>

<p>
Client cannot implement a REST API since it is not easily reachable since:
</p>
<ul class="org-ul">
<li>IP addresses change or can be private</li>
<li>device/network might have a firewall</li>
<li>client does not control DNS server</li>
<li>may be powered off or out of radio contact</li>
<li>app might not be running</li>
</ul>
</div>
</div>
<div id="outline-container-org6ceacf7" class="outline-2">
<h2 id="org6ceacf7"><span class="section-number-2">2.</span> Push Notifications</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Push notifications</b>: hacks to send messages to clients
</p>

<p>
Client&rsquo;s OS makes 1 connection for all apps and services send notifications through 3rd party.
</p>
</div>
<div id="outline-container-org7434bfe" class="outline-3">
<h3 id="org7434bfe"><span class="section-number-3">2.1.</span> Smartphones</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Location registration used for mobile push notifications.
Apple and Google run a <b>push notification service</b> (PNS) for apps on their OS.
</p>

<p>
Whenever phone gets new IP address, OS opens long-lived connection to the PNS.
PNS stores user id and IP address.
</p>

<p>
Apps cannot contact a user&rsquo;s device directly, so they send user notifications to the PNS, which
relays the message to the user&rsquo;s current P address.
</p>

<p>
OS can show notification even if app is not running.
</p>

<p>
On iOS, for privacy, different apps have different user IDs (device tokens).
</p>

<p>
To deal with NAT, OS sends keep-alive messages, where just 1 port is needed for all apps.
</p>
</div>
<div id="outline-container-org8edf70f" class="outline-4">
<h4 id="org8edf70f"><span class="section-number-4">2.1.1.</span> Device Registration</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Every time devices connect to the network, the OS creates a long-lived connection to the PNS:
</p>
<ol class="org-ol">
<li>app registers for notifications</li>
<li>PNS returns a unique push ID</li>
<li>app sends push ID to its backend service, which stores user&rsquo;s push ID in a DB for later use</li>
<li>wait for the backend to have a notification for the user</li>
<li>after the backend gets the push ID for that user from its DB, it sends a notification request
to the PNS with push ID</li>
<li>PNS uses push ID to identify the long-lives connection to the client and relay the notification</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orge93ed53" class="outline-3">
<h3 id="orge93ed53"><span class="section-number-3">2.2.</span> Web Browsers</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Designed to pull data from servers, but modern application desire updates to be pushed from service.
</p>

<p>
Client can make repeated requests for new data (polling), but poor solution that requires tradeoff
between latency and network overhead.
</p>

<p>
Websockets preferred modern solution, and long-polling before websockets.
</p>
</div>
<div id="outline-container-org1a22bc0" class="outline-4">
<h4 id="org1a22bc0"><span class="section-number-4">2.2.1.</span> Websockets</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
<b>Websocket</b>: long-lived, bi-directional network connection, similar to TCP socket but available
in JS code in browser
</p>

<p>
JS app creates websocket connection to server.
Client can then send API requests through websocket and responses come back through websocket.
</p>

<p>
Connection remains open.
</p>

<p>
Server can send messages at any time, independent of client requests.
</p>
</div>
</div>
<div id="outline-container-orga517ca5" class="outline-4">
<h4 id="orga517ca5"><span class="section-number-4">2.2.2.</span> Long-Polling</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Client sends HTTP request.
Server waits, then sends a response only when new data is ready.
If no data available within 60 seconds, send an empty response.
Client then makes another long-polling request (infinite loop).
</p>

<p>
Client instantiates request and server controls when response is sent.
</p>

<p>
Sever always has 1 outstanding request from client available to send data.
</p>

<p>
Periodic requests every 60 seconds are wasteful since periodic gap in service.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org7657fbd" class="outline-2">
<h2 id="org7657fbd"><span class="section-number-2">3.</span> Challenges</h2>
<div class="outline-text-2" id="text-3">
<p>
Challenge is to find one long-lived connection to the client.
</p>

<p>
Network socket (connection) is tied to a single IP address.
</p>

<p>
Notifications originating from anywhere in the large, distributed system must be somehow directed to the 1
appropriate notification server instance that the client is connected to.
</p>
</div>
<div id="outline-container-org87210f8" class="outline-3">
<h3 id="org87210f8"><span class="section-number-3">3.1.</span> Notification Service</h3>
<div class="outline-text-3" id="text-3-1">
<p>
To solve the problem, notifications are often a separate microservice.
</p>

<p>
Clients connect themselves by either:
</p>
<ul class="org-ul">
<li>opening a websocket</li>
<li>making an API request providing a push ID usable on APN or GCM</li>
</ul>

<p>
In both cases, user&rsquo;s location is stored in a DB.
</p>

<p>
Other microservices send notifications through API calls.
Implementation looks up connection location and relays message.
</p>
</div>
</div>
<div id="outline-container-orgdb4ffc0" class="outline-3">
<h3 id="orgdb4ffc0"><span class="section-number-3">3.2.</span> API Gateway</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Clients have long-lived websocket connections to gateway.
</p>

<p>
Requests are handled by Serverless Functions (lambdas) and when connection is established, save
connection ID.
</p>

<p>
Later, use connection ID to push data to clients.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-12-10 Tue 15:00</p>
</div>
</body>
</html>
